[
  {
    "id": "colors-avoid-pure-black",
    "title": "Avoid pure black for text and backgrounds",
    "description": "Pure black (#000000) should not be used for text or backgrounds. Use softer dark tones like #333333 for text and dark gray (#121212 or #212121) for backgrounds to improve readability, reduce eye strain, and create a more professional appearance."
  },
  {
    "id": "images-lazy-loading",
    "title": "Enable lazy loading for images and videos",
    "description": "Images and videos should load only when they enter the viewport to reduce initial page load time and improve performance. Do not lazy load above-the-fold images, as they must load immediately."
  },
  {
    "id": "navigation-breadcrumbs",
    "title": "Display breadcrumb navigation",
    "description": "Breadcrumbs should be visible near the top of the product page to help users understand site hierarchy, navigate back to categories, and improve usability and SEO. Each breadcrumb should be clickable except the current product."
  },
  {
    "id": "cta-sticky-add-to-cart",
    "title": "Sticky Add to Cart button",
    "description": "A sticky or floating Add to Cart button should remain visible when the main CTA scrolls out of view to reduce friction and keep users focused on the primary conversion goal."
  },
  {
    "id": "social-proof-product-ratings",
    "title": "Show product ratings near title",
    "description": "Product ratings should appear close to the product title and include both the average rating and total number of reviews. Clicking the rating should scroll users to the reviews section."
  },
  {
    "id": "product-title-clarity",
    "title": "Use descriptive and clear product titles",
    "description": "Product titles should clearly describe the product using relevant attributes such as brand, size, color, and key characteristics. Titles should be concise, specific, and optimized for SEO (under ~65 characters)."
  },
  {
    "id": "product-tabs",
    "title": "Use tabs or accordions for product details",
    "description": "Product pages should use clickable tabs or accordions (e.g. Description, Reviews, Specifications) to reduce clutter, improve scannability, and make information easier to access."
  },
  {
    "id": "benefits-near-title",
    "title": "Highlight key benefits near product title",
    "description": "A short list of 2–3 key benefits should be displayed near the product title to quickly communicate value and capture attention. Benefits should be specific, impactful, and aligned with key selling points."
  },
  {
    "id": "image-annotations",
    "title": "Include annotations in product images",
    "description": "Product images should include annotations or badges highlighting key benefits or differentiators to visually communicate value faster than text alone."
  },
  {
    "id": "image-thumbnails",
    "title": "Show thumbnails in product image gallery",
    "description": "The product gallery should include visible thumbnails to allow users to quickly browse all images without excessive scrolling."
  },
  {
    "id": "image-square-format",
    "title": "Use square images for consistency",
    "description": "All product images should use a 1:1 square aspect ratio to maintain visual consistency, prevent layout shifts, and improve the overall gallery appearance."
  },
  {
    "id": "image-multiple-angles",
    "title": "Show product from multiple angles",
    "description": "Product images should display multiple angles and close-ups, and include contextual or scale references where relevant, to reduce uncertainty and increase buyer confidence."
  },
  {
    "id": "image-mobile-navigation",
    "title": "Enable swipe or arrows on mobile galleries",
    "description": "On mobile devices, product image galleries should support swipe gestures or clear navigation arrows to ensure smooth browsing and engagement."
  },
  {
    "id": "image-background-consistency",
    "title": "Maintain consistent image backgrounds",
    "description": "Product images should use consistent, clean backgrounds (e.g. white or light gray) to improve perceived professionalism and avoid visual distractions."
  },
  {
    "id": "image-before-after",
    "title": "Include before-and-after images when applicable",
    "description": "For products where results matter, before-and-after images should be included to demonstrate effectiveness and increase trust."
  },
  {
    "id": "description-benefits-over-features",
    "title": "Focus on benefits in product descriptions",
    "description": "Product descriptions should emphasize how features translate into customer benefits, helping users understand how the product improves their life or solves a problem."
  },
  {
    "id": "product-comparison",
    "title": "Include a product comparison section",
    "description": "The product page must include a comparison section that compares the primary product with 2-3 similar alternatives. The comparison must: 1. Identify 2-3 similar alternatives. 2. Compare 4+ technical or functional attributes (e.g., RAM, Battery, Price, Features). 3. Use a scannable table format. 4. Explicitly highlight the 'Winner' or 'Unique Value' for the primary product. 5. Be objective yet persuasive to reduce decision fatigue. The comparison should show why the primary product is the best choice while being honest about alternatives."
  },  
  {
    "id": "ugc-customer-photos",
    "title": "Show customer photos using the product",
    "description": "Real customer photos should be featured on the product page to increase social proof, authenticity, and buyer confidence."
  },
  {
    "id": "video-testimonials",
    "title": "Add video testimonials",
    "description": "Video testimonials from real customers should be included to increase trust, engagement, and conversion rates."
  },
  {
    "id": "variant-preselection",
    "title": "Preselect the most common variant",
    "description": "Ensure the most popular size, color, or configuration is selected by default when the page loads. The preselected variant must be clearly highlighted visually (e.g., bold border, darker color, selected state) and allow users to click 'Add to Cart' immediately without selecting a variant first. If 'Add to Cart' button is disabled until a variant is selected, or all variant options look the same on page load, the rule fails."
  },  
    {
      "id": "cta-prominence",
      "title": "Make the main CTA the most prominent element",
      "description": "The primary CTA (Add to Cart/Buy Now) must be the visual focal point. It must be placed 'above the fold' (visible without scrolling), use a high-contrast color against the background (e.g., solid electric blue on white), be larger than secondary buttons, and use clear action-oriented text. Ghost buttons (transparent with thin borders) that blend into the background do NOT meet this requirement."
    },
    {
      "id": "free-shipping-threshold",
      "title": "Highlight free shipping threshold near CTA",
      "description": "Display the free shipping incentive in the immediate eye-path of the CTA. It must be located within 50-100 pixels of the main 'Add to Cart' button (directly above or below), use persuasive threshold language like 'Add $X more for Free Shipping' or 'Free shipping over $50', and be clear and readable without being more distracting than the main CTA. Shipping information only in header banners or page footer does NOT meet this requirement."
    },
  {
    "id": "trust-badges-near-cta",
    "title": "Display trust signals near the CTA",
    "description": "Security badges and payment logos (SSL, Visa, PayPal, Money-back Guarantee) must be positioned within 50px of the 'Add to Cart' or 'Checkout' buttons. These signals must be visible without scrolling and should use high-quality, muted or monochromatic designs so their visual weight is lower than the main CTA to avoid distraction."
  },
  {
    "id": "quantity-discounts",
    "title": "Offer quantity or bulk discounts",
    "description": "Product pages must display specific financial incentives for purchasing multiple units of the same product or bundles. Valid examples include 'Buy 2 Get 1 Free', tiered pricing (e.g., $10 each for 5+ units), or 'Save 10% when you buy 3'. General single-item discounts, sitewide sales, or 'Free Shipping' do not qualify."
  },  
  {
    "id": "shipping-time-visibility",
    "title": "Display shipping time near CTA",
    "description": "Ensure a dynamic delivery estimate (e.g., 'Order within X hours, get it by Y date') is placed in immediate proximity to the primary CTA. CRITERIA: 1. Must be located directly above or below the Add to Cart/Buy Now button. 2. Must include a countdown or specific cutoff time (e.g., 'Order within 2 hours', 'Order by 3 PM'). 3. Must provide a specific delivery date or range (e.g., 'Get it by Tuesday, Oct 12th', 'Delivered by Thursday'). IMPACT: High - This reduces purchase friction and prevents cart abandonment by managing expectations upfront."
  }
  
]