[
  {
    "id": "rec2NXZ5QTVyDYSua",
    "title": "Does every page have a clear Call-to-Action (CTA), including 404 error pages, search result pages with no results, blog posts, and the About Us page?",
    "description": "Make sure every page on your site has a clear, action-oriented CTA. Make sure even unconventional pages—404 pages, \"no results\" search pages, blog posts, and the About Us page—direct users toward a valuable next step.\n\n**Detailed Actions**\n- **404 Error Page**: Add a CTA guiding visitors back to the homepage, product collections, or other high-value pages to keep them engaged. Examples: \"Return to Home\" or \"Browse New Arrivals.\"\n- **No Results Search Page**: Offer a CTA to browse popular products, visit a main category, or refine the search. \"Check Best Sellers\" or \"Try Again\" can help retain visitor interest.\n- **Blog Posts**: After engaging content, prompt readers to explore related products or collections. Use a CTA like \"Shop Related Products\" or \"Explore More Styles.\"\n- **About Us Page**: Encourage users to explore your products, sign up for newsletters, or follow you on social media. Examples: \"Shop Our Collection\" or \"Sign Up for Exclusive Deals.\""
  },
  {
    "id": "recEcmUYxWGuOz3vK",
    "title": "Do button and link labels start with a verb and convey urgency (e.g., \"Shop Now\")?",
    "description": "Make sure all button and link labels start with action verbs and convey a sense of urgency. Labels like \"Shop Now\" or \"Get Yours Today\" are clear and actionable, guiding users toward making a purchase.\n\n**Detailed Actions:**\n- **Start with a Strong Verb:** Every button label should start with a verb that describes the action users will take, such as \"Buy,\" \"Explore,\" or \"Save.\" Use language that directly signals what will happen when the button is clicked.\n- **Convey Urgency:** Add a sense of immediacy by using words like \"Now,\" \"Today,\" or \"Limited Time\" where relevant. This creates a subtle pressure, nudging users to act promptly.\n- **Customize Language for Context:** Ensure buttons align with the specific goal of the page. For example, on a product page, \"Add to Cart\" or \"Buy Now\" works well, while on a homepage, \"Explore Collection\" might fit better.\n\n**WooCommerce and Shopify Tips:**\n- For WooCommerce, go to **Appearance > Customize** and adjust button text in your theme settings if available. Some themes support custom labels for product and checkout pages without additional plugins.\n- On Shopify, use the **Theme Editor** under **Online Store > Themes > Customize** to modify button labels. Most Shopify themes allow easy button text customization on product and homepage sections directly from the editor."
  },
  {
    "id": "recEqtpY2Opsp5L7J",
    "title": "Are buttons and clickable items obviously pressable with clear hover states and visual cues?",
    "description": "Check if buttons and clickable items are clearly identifiable as interactive elements. This rule verifies that:\n\n**What to Check:**\n- **Button Elements:** Look for proper HTML button elements (<button>), clickable links (<a>), or elements with button-like text (e.g., \"Add to Cart\", \"Buy Now\", \"Shop Now\").\n- **Visual Distinction:** Buttons should be clearly distinguishable from regular text. Check if buttons have distinct styling indicators (mentioned in HTML classes, IDs, or visible text that suggests they are styled differently).\n- **Clear Interactive Elements:** Verify that clickable items (buttons, links, CTAs) are present and easily identifiable in the page content.\n- **Action-Oriented Text:** Buttons should use clear action verbs like \"Add to Cart\", \"Buy Now\", \"Proceed to Checkout\", \"Shop Now\" instead of generic text like \"Click Here\" or plain text.\n\n**Note:** While hover states cannot be directly verified from HTML content alone, this rule checks for the presence of proper button elements, clear interactive text, and visual indicators that suggest buttons are styled to be clickable. If the site has proper button elements with action-oriented text, consider this rule as PASSED.\n\n**PASS if:** The site has clear button elements, clickable links, or interactive elements with action-oriented text (like \"Add to Cart\", \"Buy Now\", etc.) that are easily identifiable.\n\n**FAIL if:** No clear button elements or clickable items are found, or buttons use generic/non-action text, or interactive elements are not clearly distinguishable from regular text."
  },
  {
    "id": "recYZBCXc8EmCPzXq",
    "title": "Are there no annoying pop-ups appearing at inappropriate times (e.g., immediately upon landing)?",
    "description": "Ensure pop-ups don't appear immediately upon a user's arrival. Delay them until users are engaged with the page to reduce bounce rates and improve user experience.\n\n**Detailed Actions**\n- **Set a Delay for Pop-Ups**: Instead of showing pop-ups the moment a user lands, delay them by 20-30 seconds or wait until they've scrolled a certain percentage of the page.\n- **Limit Frequency:** Show pop-ups only once per session to avoid repeated disruptions.\n- **Use Exit-Intent Pop-Ups Strategically:** Only trigger pop-ups when users are about to leave the page, which can help capture attention without intruding.\n- **Clear Call-to-Action Text:** Ensure each button uses action-oriented text, like \"Add to Cart\" or \"Proceed to Checkout,\" instead of generic words like \"Click Here.\""
  },
  {
    "id": "recqdZbBbXoGLLZYV",
    "title": "Can the cookie notification bar be easily closed or approved within 2 seconds?",
    "description": "Ensure users can dismiss or accept the cookie notification quickly—ideally in under two seconds—by making the \"Accept\" or \"Close\" button highly visible and responsive.\n\n**Detailed Actions:**\n- **Position and Visibility:** Place the cookie notification at the bottom or top of the page to avoid interrupting the browsing experience. Avoid covering the main content or obstructing key calls-to-action.\n- **Clear and Intuitive Buttons:** Use clear labels such as \"Accept\" or \"Close.\" Avoid vague terms; clarity encourages quicker engagement.\n- **Mobile Optimization:** Ensure buttons are large enough for easy tapping on mobile devices and are accessible without excessive scrolling.\n- **Fast Load Times:** Make sure the cookie bar loads with the rest of the page, preventing any delay that could frustrate users.\n- **For WooCommerce & Shopify Users:**\n    - **WooCommerce:** Consider native theme options to adjust cookie bar layout and visibility, or use the built-in customizer for many themes. Avoid adding plugins unless the theme lacks this feature.\n    - **Shopify:** Most premium themes offer customizable cookie notification options; check the theme settings first before exploring third-party solutions.\n\nIf using a plugin is necessary, select lightweight, trusted plugins that won't slow down the site."
  },
  {
    "id": "rec6WruKWvBOCeFQj",
    "title": "Does the site use exit-intent pop-ups to capture abandoning users?",
    "description": "Implement exit-intent pop-ups to engage users who are about to leave the site. These pop-ups should offer incentives, such as discounts or free shipping, to encourage users to complete their purchase.\n\n**Detailed Actions:**\n- Set up exit-intent pop-ups that trigger when a user’s cursor moves toward the top of the screen (indicating they are about to leave the page).\n- Ensure the pop-up is designed to capture attention without being intrusive. Focus on a simple, clear message, such as offering a discount, a special deal, or encouraging them to complete their cart.\n- Make sure the pop-up is mobile-optimized and doesn’t disrupt the shopping experience.\n- Test pop-up designs and messaging to identify what works best for your audience.\n\n**For WooCommerce and Shopify Users:**\n- **Shopify Apps**: [Privy - Pop Ups](https://apps.shopify.com/privy), [OptiMonk](https://apps.shopify.com/optimonk)\n- **WooCommerce Plugins**: [OptinMonster](https://optinmonster.com/)\n\nIf you use [Mailchimp](https://mailchimp.com/?currency=EUR) or [Klavyio](https://www.klaviyo.com/) for your email marketing, they also have pop-up options."
  },
  {
    "id": "recSs12TogM60Mf6w",
    "title": "Do you use pure black for text or backgrounds?",
    "description": "Avoid using pure black (#000000) for text or backgrounds. Opt for softer dark tones like charcoal (#333333) for text and off-black colors for backgrounds.\n\nUse high contrast between text and background, but ensure the tone isn't too harsh on the eyes, improving readability and visual comfort.\n\n**Detailed Actions:**\n- **Text:** Use colors with slightly lighter shades (e.g., #333333 or #444444) for body text instead of pure black. These tones reduce the starkness that pure black creates, making reading less fatiguing, especially for longer sessions.\n- **Backgrounds:** Avoid using pure black (#000000) as a background color. Instead, choose a dark gray like #212121 or #121212. This ensures that text and images stand out while reducing visual strain.\n- **Contrast:** Ensure there's sufficient contrast between text and background, especially for accessibility. Use tools like  [Contrast Checker](https://webaim.org/resources/contrastchecker/) to verify that your combinations meet accessibility standards."
  },
  {
    "id": "recXu35FN9ZA6WTTT",
    "title": "When submitting a form for a discount code, is the discount code shown directly on the website?",
    "description": "Display the discount code directly on the website immediately after the user signs up, instead of solely sending it to their inbox. This can be done through a pop-up, banner, or confirmation message after completing the sign-up process.\n\n**Detailed Actions:** After users submit their discount code request, display the code directly on the page—preferably in a clear, attention-grabbing way (e.g., with a popup, banner, or on the page itself). Avoid redirecting users to a separate page, as it creates friction and potentially drops conversions. Ensure that users can easily copy the code for easy application at checkout.\n\n**For WooCommerce and Shopify Users:**\n- **Shopify**: Use apps like **[Privy](https://www.privy.com/), [Mailchimp](https://mailchimp.com/)** or **[Klaviyo](https://www.klaviyo.com/)** to create on-site pop-ups or banners that reveal the discount code immediately upon sign-up.\n- **WooCommerce**: Utilize plugins such as **[OptinMonster](https://optinmonster.com/)** to display the code directly on the site as soon as the user submits their email."
  },
  {
    "id": "recFTSjmOpDrdWa3D",
    "title": "Does the hero section highlight the main benefits of shopping with you (e.g., \"Easy returns\", \"Free shipping\", \"Satisfaction guaranteed\")?",
    "description": "Make sure your hero section prominently displays the key benefits of shopping with you, such as \"Easy returns,\" \"Free shipping,\" and \"Satisfaction guaranteed.\" This helps potential customers quickly understand what sets your store apart.\n\n**Detailed Actions:**\n- **Identify Key Benefits:** Determine the top 2-3 benefits that resonate most with your target audience. Use customer feedback and competitive analysis to guide your choices.\n- **Design Integration:** Ensure these benefits are visually integrated into the hero section. Use eye-catching graphics and concise text.\n- **Responsive Design:** Make sure that the hero section and its benefits are optimized for both desktop and mobile views. Check for readability and accessibility.\n- **Testing:** Conduct A/B testing to see which benefits resonate most with your audience. This can involve changing the phrasing, placement, or design of the benefits.\n\n**For WooCommerce and Shopify Users:**\n- **Shopify**\n    - Customize your theme settings to include the benefits in the hero section or use apps like [Shogun Page Builder](https://getshogun.com/page-builder) for more control over layout.\n- **WooCommerce**\n    - Use a page builder plugin like [Elementor](https://elementor.com/) or [WPBakery](https://wpbakery.com/) to customize your hero section easily."
  },
  {
    "id": "recM631vdg2m8Zdzp",
    "title": "Has the hero section been tested using a 5-second test to ensure key messages are clear?",
    "description": "Conduct a 5-second test using tools like [UsabilityHub](https://www.lyssna.com/features/five-second-testing/) (they normally give some free credits) or [UserTesting](https://www.usertesting.com/) to evaluate whether users can identify the main message, value proposition, and CTA in the hero section within the first 5 seconds of viewing."
  },
  {
    "id": "recyjfTDztnJgcdtY",
    "title": "Is the value proposition clearly stated on the homepage (e.g., with a tagline or welcome blurb)?",
    "description": "Clearly define your unique value proposition (UVP) in a prominent position, such as near the hero section, using concise and compelling language.\n\n**Detailed Actions:**\n- **Craft a Compelling Tagline:** Create a succinct tagline (ideally under 10 words) that encapsulates your brand's essence and what makes you stand out from competitors. This should be the first thing users see when they land on your homepage.\n- **Positioning:** Place your value proposition in a high-visibility area of your homepage, such as the hero section or above the fold. It should be one of the first elements a visitor encounters.\n- **Visual Elements:** Use engaging visuals or background images that complement your value proposition and evoke the right emotions. Ensure the text is legible against the background.\n- **Test Variations:** Utilize A/B testing to experiment with different taglines or placements to see which resonates most with your audience."
  }
]